test/mutations/contract-empty-body-fallback-removed.patch
diff --git a/skills/implement/scripts/parallel-contract b/skills/implement/scripts/parallel-contract
index bfb9abe..a5839f5 100755
--- a/skills/implement/scripts/parallel-contract
+++ b/skills/implement/scripts/parallel-contract
@@ -58,11 +58,6 @@ body=$(awk -v first="$first" -v last="$last" '
   }
 ' "$plan")
 
-if [ -z "$body" ]; then
-  body="No phase in ${first}-${last} freezes anything for later phases.
-Nothing in this range is off limits to ordinary findings."
-fi
-
 out_text="# Frozen contract — phases ${first}-${last}
 
 Names, signatures and data shapes that later phases were briefed against. A
