test/mutations/contract-fence-toggle-deleted.patch
diff --git a/skills/implement/scripts/parallel-contract b/skills/implement/scripts/parallel-contract
index bfb9abe..9c34f54 100755
--- a/skills/implement/scripts/parallel-contract
+++ b/skills/implement/scripts/parallel-contract
@@ -34,8 +34,6 @@ esac
 [ "$first" -le "$last" ] 2>/dev/null || { echo "bad RANGE: $range" >&2; exit 2; }
 
 body=$(awk -v first="$first" -v last="$last" '
-  /^```/ { fence = !fence }
-
   !fence && /^###[ \t]+Phase[ \t]+[0-9]+/ {
     n = $0; sub(/^###[ \t]+Phase[ \t]+/, "", n); sub(/[^0-9].*$/, "", n)
     inseg = (n + 0 >= first && n + 0 <= last)
