test/mutations/contract-field-heading-loosened.patch
diff --git a/skills/implement/scripts/parallel-contract b/skills/implement/scripts/parallel-contract
index bfb9abe..e9c855b 100755
--- a/skills/implement/scripts/parallel-contract
+++ b/skills/implement/scripts/parallel-contract
@@ -45,7 +45,7 @@ body=$(awk -v first="$first" -v last="$last" '
   }
 
   !fence && /^\*\*[A-Z]/ {
-    infield = (inseg && $0 ~ /^\*\*Frozen for later phases\*\*/)
+    infield = (inseg && $0 ~ /^\*\*/)
     if (infield) printed_title = 0
     next
   }
