test/mutations/contract-inseg-inverted.patch
diff --git a/skills/implement/scripts/parallel-contract b/skills/implement/scripts/parallel-contract
index bfb9abe..c0e3f63 100755
--- a/skills/implement/scripts/parallel-contract
+++ b/skills/implement/scripts/parallel-contract
@@ -38,7 +38,7 @@ body=$(awk -v first="$first" -v last="$last" '
 
   !fence && /^###[ \t]+Phase[ \t]+[0-9]+/ {
     n = $0; sub(/^###[ \t]+Phase[ \t]+/, "", n); sub(/[^0-9].*$/, "", n)
-    inseg = (n + 0 >= first && n + 0 <= last)
+    inseg = !(n + 0 >= first && n + 0 <= last)
     title = $0; sub(/^###[ \t]+/, "", title)
     infield = 0
     next
