test/mutations/dispatch-bare-number-not-expanded.patch
diff --git a/skills/implement/scripts/dispatch b/skills/implement/scripts/dispatch
index 602e03d..7004ee3 100755
--- a/skills/implement/scripts/dispatch
+++ b/skills/implement/scripts/dispatch
@@ -77,7 +77,8 @@ def parse_range(raw):
     if m:
         first, last = int(m.group(1)), int(m.group(2))
     elif re.fullmatch(r"\d+", raw):
-        first = last = int(raw)
+        first = int(raw)
+        last = int(raw) + 1
     else:
         die("bad RANGE: %s (want 3 or 2-4)" % raw, 2)
     if first > last:
