test/mutations/dispatch-extract-written-path-no-anchor.patch
diff --git a/skills/implement/scripts/dispatch b/skills/implement/scripts/dispatch
index 602e03d..725b147 100755
--- a/skills/implement/scripts/dispatch
+++ b/skills/implement/scripts/dispatch
@@ -268,7 +268,7 @@ def find_criteria():
 
 def extract_written_path(brief_stdout):
     """brief prints 'wrote <path>: N lines' on success."""
-    m = re.search(r"^wrote (.+): \d+ lines$", brief_stdout.strip(), re.MULTILINE)
+    m = re.search(r"(/\S+)", brief_stdout.strip())
     if not m:
         die("brief produced unexpected output:\n%s"
             % indent(brief_stdout.strip() or "(empty)"))
