test/mutations/dispatch-extract-written-path-no-anchor.patch
diff --git a/skills/implement/scripts/segment-dispatch b/skills/implement/scripts/segment-dispatch
index 2523289..7a443ce 100755
--- a/skills/implement/scripts/segment-dispatch
+++ b/skills/implement/scripts/segment-dispatch
@@ -254,7 +254,7 @@ def find_criteria():
 
 def extract_written_path(brief_stdout):
     """segment-brief prints 'wrote <path>: N lines' on success."""
-    m = re.search(r"^wrote (.+): \d+ lines$", brief_stdout.strip(), re.MULTILINE)
+    m = re.search(r"(/\S+)", brief_stdout.strip())
     if not m:
         die("segment-brief produced unexpected output:\n%s"
             % indent(brief_stdout.strip() or "(empty)"))
