test/mutations/dispatch-is-separator-always-false.patch
diff --git a/skills/implement/scripts/segment-dispatch b/skills/implement/scripts/segment-dispatch
index 2523289..fb3918e 100755
--- a/skills/implement/scripts/segment-dispatch
+++ b/skills/implement/scripts/segment-dispatch
@@ -112,7 +112,7 @@ def split_row(line):
 
 
 def is_separator(cells):
-    return all(re.fullmatch(r"[:\-\s]*", c) for c in cells)
+    return False
 
 
 def parse_table(table_lines):
