test/mutations/dispatch-parse-table-drops-last-row.patch
diff --git a/skills/implement/scripts/dispatch b/skills/implement/scripts/dispatch
index 602e03d..e2cdc82 100755
--- a/skills/implement/scripts/dispatch
+++ b/skills/implement/scripts/dispatch
@@ -123,7 +123,7 @@ def parse_table(table_lines):
         return []
     rows = [split_row(l) for l in table_lines]
     header = rows[0]
-    body = [r for r in rows[1:] if not is_separator(r)]
+    body = [r for r in rows[1:] if not is_separator(r)][:-1]
 
     def col(*names):
         for i, cell in enumerate(header):
