test/mutations/finish-conventional-inverted.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 758cfd6..b0aaffe 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -136,7 +136,7 @@ assert_message_ok() {
   if printf '%s' "$subject" | grep -qE '<type>|<scope>|<one line'; then
     die "the subject line in $msgfile is still the placeholder — write the real one"
   fi
-  if ! printf '%s' "$subject" | grep -qE "$CONVENTIONAL"; then
+  if printf '%s' "$subject" | grep -qE "$CONVENTIONAL"; then
     die "subject is not Conventional Commits ('$subject')
   use 'type(scope): summary'; type in feat|fix|docs|style|refactor|perf|test|build|ci|chore|revert
   commit-guard cannot see a -F message, so this is the only place it is checked"
