test/mutations/finish-integrate-ancestor-check-removed.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 2563299..76c907c 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -267,10 +267,6 @@ cmd_integrate() {
   # file in the main checkout standing where a tracked one was about to land.
   # That message sends the human to `finish rebase`, which cannot help, and it
   # hides the one thing they need to know — which file is in the way.
-  if ! git merge-base --is-ancestor "$def" "$branch"; then
-    die "not a fast-forward — $def has moved; rebase first (finish rebase)"
-  fi
-
   was="$(git -C "$main_root" rev-parse --abbrev-ref HEAD)"
   if ! out="$(git -C "$main_root" checkout "$def" 2>&1)"; then
     die "cannot check out $def in the main checkout ($main_root).
