test/mutations/finish-integrate-collision-mislabelled.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 2563299..971c900 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -285,10 +285,7 @@ $out"
     echo "integrated $branch into $def (fast-forward)"
   else
     git -C "$main_root" checkout --quiet "$was" 2>/dev/null || true
-    die "the merge into $def failed even though it is a fast-forward by the
-graph. git's own reason, verbatim:
-
-$out"
+    die "not a fast-forward — $def has moved; rebase first (finish rebase)"
   fi
 }
 
