test/mutations/finish-recover-defaults-to-first.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 2563299..aa29b22 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -318,13 +318,7 @@ cmd_recover() {
   [ -n "$attempts" ] || die "no recovery ref under $prefix/ — nothing to recover"
 
   if [ -z "$want" ]; then
-    echo "recovery attempts on this branch, newest last:"
-    printf '%s\n' "$attempts" | while IFS=$'\t' read -r n sha; do
-      printf '  %s  %s  %s\n' "$n" "$(git rev-parse --short "$sha")" \
-        "$(git log -1 --format=%s "$sha")"
-    done
-    echo "name one: finish recover <attempt>"
-    exit 2
+    want="$(printf '%s\n' "$attempts" | head -1 | cut -f1)"
   fi
 
   case "$want" in ''|*[!0-9]*) die "attempt must be a number; got '$want'" ;; esac
