test/mutations/finish-recover-noop.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 2563299..fabbeea 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -333,7 +333,7 @@ cmd_recover() {
     || die "no attempt $want on this branch — run 'finish recover' with no argument to see what there is"
 
   echo "resetting to $(git rev-parse --short "$ref") (attempt $want)"
-  git reset --hard "$ref"
+  git reset --hard HEAD
   echo "recovered; every recovery ref is left in place"
 }
 
