test/mutations/finish-recovery-ref-after-reset.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 2563299..de7feb1 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -196,10 +196,9 @@ cmd_squash() {
   before="$(git rev-parse 'HEAD^{tree}')"
   pre_squash="$(git rev-parse HEAD)"
 
-  record_recovery
-
   git reset --soft "$base"
   git commit --cleanup=strip -F "$msgfile" --quiet
+  record_recovery
 
   after="$(git rev-parse 'HEAD^{tree}')"
   if [ "$before" != "$after" ]; then
