test/mutations/finish-recovery-ref-overwritable.patch
diff --git a/skills/finish/scripts/finish b/skills/finish/scripts/finish
index 2563299..b6e121b 100755
--- a/skills/finish/scripts/finish
+++ b/skills/finish/scripts/finish
@@ -108,9 +108,9 @@ record_recovery() {
   local prefix max n ref
   prefix="$(recovery_prefix)"
   max="$(recovery_attempts | tail -1 | cut -f1)"
-  n=$(( ${max:-0} + 1 ))
+  n=1
   ref="$prefix/$n"
-  git update-ref "$ref" HEAD "" \
+  git update-ref "$ref" HEAD \
     || die "recovery ref $ref already exists — refusing to overwrite it; inspect it with 'finish recover' and clear it deliberately"
   echo "recovery ref: $ref -> $(git rev-parse --short HEAD)"
 }
