test/mutations/plan-check-exit-relaxed.patch
diff --git a/skills/implement/scripts/plan-check b/skills/implement/scripts/plan-check
index ab38bbb..f62bc47 100755
--- a/skills/implement/scripts/plan-check
+++ b/skills/implement/scripts/plan-check
@@ -287,7 +287,7 @@ if [ "${#findings[@]}" -gt 0 ]; then
     echo "$msg"
     echo
   done
-  exit 1
+  exit 0
 fi

 exit 0
