test/mutations/plan-check-field-check-not-per-phase.patch
diff --git a/skills/implement/scripts/plan-check b/skills/implement/scripts/plan-check
index ab38bbb..e106522 100755
--- a/skills/implement/scripts/plan-check
+++ b/skills/implement/scripts/plan-check
@@ -140,7 +140,6 @@ field_issues=$(awk '
     phase = n + 0
     phase_line = NR
     inphase = 1
-    delete has
     next
   }

