test/mutations/plan-check-phases-repair-noop.patch
diff --git a/skills/implement/scripts/plan-check b/skills/implement/scripts/plan-check
index a1aaa6d..987a611 100755
--- a/skills/implement/scripts/plan-check
+++ b/skills/implement/scripts/plan-check
@@ -95,7 +95,6 @@ if [ -z "$phases_line" ]; then
     plan_mode=$(stat -f '%Lp' "$plan" 2>/dev/null || stat -c '%a' "$plan")
     awk -v n="$phase1_line" 'NR==n { print "## Phases"; print "" } { print }' "$plan" > "$tmp"
     chmod "$plan_mode" "$tmp"
-    mv "$tmp" "$plan"
     fixed+=("fixed: inserted '## Phases' above '### Phase 1.' (was line ${phase1_line}) in ${plan}")
   else
     findings+=("'## Phases' is missing from ${plan}, and there is no '### Phase 1.' heading to anchor an automatic repair — add '## Phases' above the first phase heading yourself. ${DONT_READ}")
