test/mutations/preflight-default-branch-check-removed.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index d3555a8..2575646 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -37,8 +37,6 @@ if [ -z "$def" ]; then
   fi
 fi
 [ "$branch" = "HEAD" ] && add "detached HEAD — commits here belong to no branch"
-[ -n "$def" ] && [ "$branch" = "$def" ] \
-  && add "on the default branch ($def) — execution needs its own branch or worktree"
 
 staged="$(git diff --cached --name-only 2>/dev/null | wc -l | tr -d ' ')"
 unstaged="$(git diff --name-only 2>/dev/null | wc -l | tr -d ' ')"
