test/mutations/preflight-dirty-tree-check-removed.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index d3555a8..cc8465e 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -42,9 +42,6 @@ fi
 
 staged="$(git diff --cached --name-only 2>/dev/null | wc -l | tr -d ' ')"
 unstaged="$(git diff --name-only 2>/dev/null | wc -l | tr -d ' ')"
-if [ "${staged:-0}" -gt 0 ] || [ "${unstaged:-0}" -gt 0 ]; then
-  add "uncommitted changes (${staged} staged, ${unstaged} unstaged) — they will land in the run's commits"
-fi
 
 # --- how far the base has moved -------------------------------------------
 if [ -n "$def" ] && git rev-parse --verify --quiet "origin/$def" >/dev/null 2>&1; then
