test/mutations/preflight-final-exit-relaxed.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index d3555a8..9365095 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -97,4 +97,4 @@ if [ ${#findings[@]} -eq 0 ]; then
   exit 0
 fi
 for f in "${findings[@]}"; do printf '  - %s\n' "$f"; done
-exit 1
+exit 0
