test/mutations/preflight-gitignore-tracked-check-removed.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index 1747db1..70f9f24 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -160,9 +160,7 @@ fi
 # in the main checkout, where an untracked copy of the same path is in the way.
 # git reports that as a refused checkout, which reads like the base has moved.
 # Naming it here costs one commit now instead of a wrong diagnosis later.
-if ! git ls-files --error-unmatch -- "$ignore" >/dev/null 2>&1; then
-  add ".gitignore is not tracked — commit it before the run, or integration collides with the untracked copy in the main checkout"
-fi
+:
 
 if [ "$gitdir" != "$common" ] && [ ! -e "$root/.ai-workflow" ]; then
   main_checkout="$(cd "$common/.." 2>/dev/null && pwd -P || true)"
