test/mutations/preflight-gitignore-trailing-slash.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index d3555a8..a95f55a 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -59,7 +59,7 @@ fi
 # --- the artifacts have to be reachable and ignored ------------------------
 ignore="$root/.gitignore"
 if [ ! -f "$ignore" ] || ! grep -qxF '.ai-workflow' "$ignore"; then
-  printf '.ai-workflow\n' >> "$ignore"
+  printf '.ai-workflow/\n' >> "$ignore"
   echo "fixed: added '.ai-workflow' to .gitignore (no trailing slash — it is a symlink in a worktree)"
 fi
 
