test/mutations/preflight-parallel-fence-not-skipped.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index 1747db1..1f07395 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -29,8 +29,6 @@ set -uo pipefail
 changes_paths() {
   local plan="$1" first="$2" last="$3"
   awk -v first="$first" -v last="$last" '
-    /^```/ { fence = !fence; next }
-    fence { next }
 
     /^###[ \t]+Phase[ \t]+[0-9]+/ {
       n = $0; sub(/^###[ \t]+Phase[ \t]+/, "", n); sub(/[^0-9].*$/, "", n)
