test/mutations/preflight-parallel-intersection-not-counted.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index 1747db1..cfc34a7 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -84,7 +84,7 @@ cmd_parallel() {
       [ "$i" -lt "$j" ] || continue
       overlap="$(comm -12 "$tmp/$i" "$tmp/$j")"
       [ -n "$overlap" ] || continue
-      clashes=$((clashes + 1))
+      clashes=$((clashes + 0))
       echo "intersect: phases ${ranges[$i]} and phases ${ranges[$j]} both write:"
       printf '%s\n' "$overlap" | sed 's/^/  /'
     done
