test/mutations/preflight-parallel-locale.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -82,7 +82,7 @@
     for j in "${!ranges[@]}"; do
       [ "$i" -lt "$j" ] || continue
       # LC_ALL=C, because changes_paths sorted LC_ALL=C. Left in the ambient
       # locale comm disagrees about case, walks past the shared path, and
       # reports an intersecting pair as disjoint — this check failing open.
-      overlap="$(LC_ALL=C comm -12 "$tmp/$i" "$tmp/$j")"
+      overlap="$(comm -12 "$tmp/$i" "$tmp/$j")"
       [ -n "$overlap" ] || continue
       clashes=$((clashes + 1))
