test/mutations/runstate-base-is-head.patch
diff --git a/skills/implement/scripts/run-state b/skills/implement/scripts/run-state
index a6f395a..c806e87 100755
--- a/skills/implement/scripts/run-state
+++ b/skills/implement/scripts/run-state
@@ -52,7 +52,7 @@ case "${1:-}" in
     dir="$("$here/workspace" "$plan")"
     {
       echo "plan=$plan"
-      echo "base=$(git rev-parse "$base")"
+      echo "base=$(git rev-parse HEAD)"
       echo "branch=$(git rev-parse --abbrev-ref HEAD)"
       echo "tree=$root"
       echo "started=$(date -u '+%Y-%m-%dT%H:%M:%SZ')"
