test/mutations/runstate-end-first-only.patch
diff --git a/skills/implement/scripts/run-state b/skills/implement/scripts/run-state
index a6f395a..67175f8 100755
--- a/skills/implement/scripts/run-state
+++ b/skills/implement/scripts/run-state
@@ -73,7 +73,7 @@ case "${1:-}" in
   end)
     markers="$(find_markers)"
     [ -n "$markers" ] || { echo "no run in progress" >&2; exit 1; }
-    printf '%s\n' "$markers" | while IFS= read -r m; do
+    printf '%s\n' "$markers" | head -1 | while IFS= read -r m; do
       rm "$m"
       echo "cleared $m"
     done
