test/mutations/runstate-guard-removed.patch
diff --git a/skills/implement/scripts/run-state b/skills/implement/scripts/run-state
index a6f395a..17a0988 100755
--- a/skills/implement/scripts/run-state
+++ b/skills/implement/scripts/run-state
@@ -41,14 +41,6 @@ case "${1:-}" in
     [ -f "$plan" ] || { echo "no such plan file: $plan" >&2; exit 2; }
     git rev-parse --verify --quiet "$base" >/dev/null || { echo "bad BASE: $base" >&2; exit 2; }
 
-    existing="$(find_markers)"
-    if [ -n "$existing" ]; then
-      echo "a run is already in progress in this repository:" >&2
-      printf '%s\n' "$existing" | while IFS= read -r m; do sed 's/^/  /' "$m" >&2; done
-      echo "finish it with dev-skills:finish, or clear it with 'run-state end'" >&2
-      exit 3
-    fi
-
     dir="$("$here/workspace" "$plan")"
     {
       echo "plan=$plan"
